const articlesData = [
    {
        title: 'Заголовок статьи 1',
        content: 'Содержание статьи 1'
    },
    {
        title: 'Заголовок статьи 2',
        content: 'Содержание статьи 2'
    }
];

const articlesData1 = [
    {
        title: 'Заголовок статьи 1',
        content: 'Содержание статьи 1'
    },
    
    {
        title: 'Заголовок статьи 2',
        content: 'Содержание статьи 2'
    },
    {
        title: 'Заголовок статьи 3',
        content: 'Содержание статьи 3'
    }
];